erp3l/src/Documents/ПереносЛимитов/ПереносЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереносЛимитов</name>
  <registerRecords>AccumulationRegister.ЛимитыПоБюджетам</registerRecords>
  <attributes>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодЛимитирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>DefinedType.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DefinedType.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЛимитирования</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийПереносЛимитов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Источник</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатель</name>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>DefinedType.ЦФО</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>DefinedType.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>Characteristic.ВидыБюджетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика1</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика2</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика3</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика4</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика5</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Аналитика6</name>
      <type>
        <types>Characteristic.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодЛимитирования</name>
      <type>
        <types>CatalogRef.Периоды</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить_Валюта</name>
      <type>
        <types>DefinedType.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Удалить_ВидБюджета</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/AccumulationRegisters/ЛимитыПоБюджетам/ЛимитыПоБюджетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛимитыПоБюджетам</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Лимит</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Корректировка</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Зарезервировано</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Заявлено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Исполнено</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>КОбеспечению</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>ДефицитРезерва</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументРегистратор</name>
    <type>
      <types>DefinedType.РегистрацияДанныхБюджетированияСсылки</types>
    </type>
  </attributes>
  <dimensions>
    <name>Предназначение</name>
    <type>
      <types>DefinedType.Предназначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументРезервирования</name>
    <type>
      <types>DocumentRef.ОперативныйПлан</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодЛимитирования</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>DefinedType.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>Characteristic.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика1</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика2</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика3</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика4</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика5</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аналитика6</name>
    <type>
      <types>Characteristic.ВидыСубконтоКорпоративные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>DefinedType.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПланирования</name>
    <type>
      <types>DefinedType.ДокументыПланированияЛимитов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

erp3l/src/Enums/ВидыОперацийПереносЛимитов/ВидыОперацийПереносЛимитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПереносЛимитов</name>
  <enumValues>
    <name>ПереносЦФО</name>
  </enumValues>
  <enumValues>
    <name>ПереносЦФОПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносСтатья</name>
  </enumValues>
  <enumValues>
    <name>ПереносСтатьяЦФО</name>
  </enumValues>
  <enumValues>
    <name>ПереносСтатьяПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносСтатьяЦФОПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериод</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериодЦФО</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериодЦФОПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериодПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериодСтатья</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериодСтатьяЦФО</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериодСтатьяПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносПериодСтатьяЦФОПроект</name>
  </enumValues>
  <enumValues>
    <name>ПереносПроизвольный</name>
  </enumValues>
  <enumValues>
    <name>ПереносАналитикиНеУказаны</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураДанныхОбновлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/ChartsOfCharacteristicTypes/ВидыБюджетов/ВидыБюджетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыБюджетов</name>
  <type>
    <types>CatalogRef.СтатьиДоходовИРасходов</types>
    <types>CatalogRef.СтатьиДвиженияРесурсов</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
  </type>
  <predefined>
    <items>
      <name>БюджетДвиженияДенежныхСредств</name>
      <description>Бюджет движения денежных средств</description>
      <code>БДДС</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>БюджетДоходовИРасходов</name>
      <description>Бюджет доходов и расходов</description>
      <code>БДР</code>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </items>
    <items>
      <name>БюджетДвиженияРесурсов</name>
      <description>Бюджет закупок</description>
      <code>Ресурсы</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияРесурсов</types>
      </type>
    </items>
  </predefined>
  <attributes>
    <name>Предназначение</name>
    <type>
      <types>DefinedType.Предназначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВалютнаяПоУмолчанию</name>
    <type>
      <types>EnumRef.ВариантыУстановкиПризнакаВалютнаяСтатьиБюджета</types>
    </type>
  </attributes>
</mdclass:ChartOfCharacteristicTypes>

erp3l/src/Documents/ПереносЛимитов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипИсточника = ТипЗнч(ДанныеЗаполнения);
	Если ТипИсточника <> Тип("Структура") Тогда
		ДанныеИсточник = ДанныеЗаполнения;
		ДанныеЗаполнения = Новый Структура;
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Ответственный", Пользователи.ТекущийПользователь());
	
	Если ДанныеЗаполнения.Свойство("Источник") Тогда
		
		ДанныеЗаполнения.Вставить("ИспользоватьЛимитирование");
		ДанныеЗаполнения.Вставить("ПериодичностьЛимитирования");
		ДанныеЗаполнения.Вставить("СпособОпределенияВалютыЛимитирования");
		Документы.ПереносЛимитов.ЗаполнитьПараметрыЛимитирования(ДанныеЗаполнения);
		
		Для Каждого Строка Из ДанныеЗаполнения.Источник Цикл
			ЗаполнитьЗначенияСвойств(Источник.Добавить(), Строка);
		КонецЦикла;
	ИначеЕсли ДанныеЗаполнения.Свойство("ПеренестиНеиспользованныеЛимиты") Тогда
		ВыполнитьЗаполнениеПоДаннымПереносаЛимитов(ДанныеЗаполнения);
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("ВидБюджета") Тогда
		ДанныеЗаполнения.Вставить("ВидБюджета", ПланыВидовХарактеристик.ВидыБюджетов.БюджетДвиженияДенежныхСредств);
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("ГодЛимитирования") Тогда
		ДанныеЗаполнения.Вставить("ГодЛимитирования", НачалоГода(ТекущаяДатаСеанса()));
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ВидБюджета") И ДанныеЗаполнения.Свойство("ГодЛимитирования") Тогда
		
		ДанныеЗаполнения.Вставить("ИспользоватьЛимитирование");
		ДанныеЗаполнения.Вставить("ПериодичностьЛимитирования");
		ДанныеЗаполнения.Вставить("СпособОпределенияВалютыЛимитирования");
		Если НЕ ДанныеЗаполнения.Свойство("Валюта") Тогда
			ДанныеЗаполнения.Вставить("Валюта");
		КонецЕсли;
		
		Документы.ПереносЛимитов.ЗаполнитьПараметрыЛимитирования(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	//
	СуммаДокумента = Источник.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Соответствие сумм источника и получателя
	ИтогоПолучатель = Получатель.Итог("Сумма");
	ИтогоИсточник = Источник.Итог("Сумма");
	Если ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПроизвольный И ИтогоПолучатель <> ИтогоИсточник Тогда
		Шаблон = НСтр("ru = 'Итого по строкам источника лимитов бюджетов (%1) не равно итого по строкам получателя лимитов (%2). Проведение невозможно.'");
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон(Шаблон, ИтогоИсточник, ИтогоПолучатель),,,,Отказ);
	КонецЕсли;
	
	//
	МассивНепроверяемыхРеквизитов = Новый Массив();
	Если ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносАналитикиНеУказаны
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПроизвольный
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПроект Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЦФО");
		МассивНепроверяемыхРеквизитов.Добавить("ПериодЛимитирования");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяБюджета");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПериод
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПериодПроект Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЦФО");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяБюджета");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПериодСтатья
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПериодСтатьяПроект Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЦФО");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПериодСтатьяЦФО Тогда
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПериодЦФО
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносПериодЦФОПроект Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяБюджета");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносСтатья
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносСтатьяПроект Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ЦФО");
		МассивНепроверяемыхРеквизитов.Добавить("ПериодЛимитирования");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносСтатьяЦФО
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносСтатьяЦФОПроект Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПериодЛимитирования");
	ИначеЕсли ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносЦФО
		ИЛИ ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносЦФОПроект Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПериодЛимитирования");
		МассивНепроверяемыхРеквизитов.Добавить("СтатьяБюджета");
	КонецЕсли;
	
	// Удаляем
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ВидОперации = Перечисления.ВидыОперацийПереносЛимитов.ПереносАналитикиНеУказаны Тогда
		ТекстСообщения = НСтр("ru = 'На закладке ""Получатель лимитов"" не указаны целевые аналитики для переноса лимитов. Проведение невозможно.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Возврат;
	КонецЕсли;
	
	//
	ПроведениеСерверОПК.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	Документы.ПереносЛимитов.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведениеСерверОПК.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);	
	
	//
	КонтрольЛимитовУХ.ОтразитьЛимитыПоБюджетам(ДополнительныеСвойства, Движения, Отказ);
	
	//
	СформироватьСписокРегистровДляКонтроля();
	ПроведениеСерверОПК.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСерверОПК.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
	
	ПроведениеСерверОПК.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьСписокРегистровДляКонтроля()
	
	Массив = Новый Массив;
	Массив.Добавить(Движения.ЛимитыПоБюджетам);
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
КонецПроцедуры

Процедура ВыполнитьЗаполнениеПоДаннымПереносаЛимитов(ДанныеЗаполнения)
	
	ВидБюджета = ДанныеЗаполнения.ВидБюджета;
	Валюта = ДанныеЗаполнения.Валюта;
	ПериодЛимитирования = ДанныеЗаполнения.ПеренестиНеиспользованныеЛимиты.ПериодЛимитированияПолучатель; 
	ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийПереносЛимитов.ПереносПериод");
	
	ДатаЗаполнения = ПериодЛимитирования.ДатаНачала;
	
	ПараметрыЛимитирования = Документы.ПереносЛимитов.ПолучитьПараметрыЛимитирования(ВидБюджета,ДатаЗаполнения);
	ИспользоватьЛимитирование = ПараметрыЛимитирования.ИспользоватьЛимитирование;
	ПериодичностьЛимитирования = ПараметрыЛимитирования.ПериодичностьЛимитирования;
	СпособОпределенияВалютыЛимитирования = ПараметрыЛимитирования.СпособОпределенияВалютыЛимитирования;
	ГодЛимитирования = НачалоГода(ДатаЗаполнения);
	
	ТаблицаОтбора = Новый ТаблицаЗначений;
	ТаблицаОтбора.Колонки.Добавить("ЦФО",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаОтбора.Колонки.Добавить("Проект",Новый ОписаниеТипов("СправочникСсылка.Проекты"));	
	Для Каждого СтрокаОтбора Из ДанныеЗаполнения.ПеренестиНеиспользованныеЛимиты.Отбор Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаОтбора.Добавить(), СтрокаОтбора);
	КонецЦикла;	
	ТаблицаОтбора.Свернуть("ЦФО,Проект");
	ЦФООтбор = ДанныеЗаполнения.ПеренестиНеиспользованныеЛимиты.Отбор[0].ЦФО;
	ПроектОтбор = ДанныеЗаполнения.ПеренестиНеиспользованныеЛимиты.Отбор[0].Проект;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаОтбора",	ТаблицаОтбора);
	Запрос.УстановитьПараметр("ДатаНачала", 	НачалоГода(ДатаЗаполнения));
	Запрос.УстановитьПараметр("ДатаОкончания",	ДатаЗаполнения - 1);
	Запрос.УстановитьПараметр("Периодичность",	ПериодичностьЛимитирования);
	Запрос.УстановитьПараметр("ВидБюджета",		ВидБюджета);
	Запрос.УстановитьПараметр("Валюта",			Валюта);
	Запрос.УстановитьПараметр("Проект",			ПроектОтбор);
	Запрос.УстановитьПараметр("ЦФО",			ЦФООтбор);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Периоды.Ссылка КАК ПериодЛимитирования
	|ПОМЕСТИТЬ ВТ_ПериодыЛимитирования
	|ИЗ
	|	Справочник.Периоды КАК Периоды
	|ГДЕ
	|	Периоды.Периодичность = &Периодичность
	|	И Периоды.ДатаНачала >= &ДатаНачала
	|	И Периоды.ДатаОкончания <= &ДатаОкончания
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаОтбора.ЦФО КАК ЦФО,
	|	ТаблицаОтбора.Проект КАК Проект
	|ПОМЕСТИТЬ ТаблицаОтбора
	|ИЗ
	|	&ТаблицаОтбора КАК ТаблицаОтбора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛимитыПоБюджетамОбороты.ПериодЛимитирования КАК ПериодЛимитирования,
	|	ЛимитыПоБюджетамОбороты.ЦФО КАК ЦФО,
	|	ЛимитыПоБюджетамОбороты.Проект КАК Проект,
	|	ЛимитыПоБюджетамОбороты.СтатьяБюджета КАК СтатьяБюджета,
	|	ЛимитыПоБюджетамОбороты.Аналитика1 КАК Аналитика1,
	|	ЛимитыПоБюджетамОбороты.Аналитика2 КАК Аналитика2,
	|	ЛимитыПоБюджетамОбороты.Аналитика3 КАК Аналитика3,
	|	ЛимитыПоБюджетамОбороты.Аналитика4 КАК Аналитика4,
	|	ЛимитыПоБюджетамОбороты.Аналитика5 КАК Аналитика5,
	|	ЛимитыПоБюджетамОбороты.Аналитика6 КАК Аналитика6,
	|	ЛимитыПоБюджетамОбороты.Валюта КАК Валюта,
	|	ЛимитыПоБюджетамОбороты.ЛимитОборот КАК Лимит,
	|	ЛимитыПоБюджетамОбороты.КорректировкаОборот КАК Корректировка,
	|	ЛимитыПоБюджетамОбороты.ЛимитОборот + ЛимитыПоБюджетамОбороты.КорректировкаОборот - ЛимитыПоБюджетамОбороты.ЗарезервированоОборот - ЛимитыПоБюджетамОбороты.ЗаявленоОборот - ЛимитыПоБюджетамОбороты.ИсполненоОборот КАК Сумма
	|ИЗ
	|	РегистрНакопления.ЛимитыПоБюджетам.Обороты(
	|			,
	|			,
	|			,
	|			Предназначение В
	|					(ВЫБРАТЬ
	|						ПВХ.Предназначение
	|					ИЗ
	|						ПланВидовХарактеристик.ВидыБюджетов КАК ПВХ
	|					ГДЕ
	|						ПВХ.Ссылка = &ВидБюджета)
	|				И Валюта = &Валюта
	|				И ПериодЛимитирования В
	|					(ВЫБРАТЬ
	|						ВТ_ПериодыЛимитирования.ПериодЛимитирования КАК ПериодЛимитирования
	|					ИЗ
	|						ВТ_ПериодыЛимитирования КАК ВТ_ПериодыЛимитирования)
	|				И (ЦФО, Проект) В
	|					(ВЫБРАТЬ
	|						ТаблицаОтбора.ЦФО,
	|						ТаблицаОтбора.Проект
	|					ИЗ
	|						ТаблицаОтбора)) КАК ЛимитыПоБюджетамОбороты
	|ГДЕ
	|	ЛимитыПоБюджетамОбороты.ЛимитОборот + ЛимитыПоБюджетамОбороты.КорректировкаОборот - ЛимитыПоБюджетамОбороты.ЗарезервированоОборот - ЛимитыПоБюджетамОбороты.ЗаявленоОборот - ЛимитыПоБюджетамОбороты.ИсполненоОборот > 0";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Источник.Загрузить(Результат.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
